Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешитьПродажу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСвойства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаОтКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныЗакупки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВендора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыПроизводителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семейство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СемействаМоделей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьСпецификацию		= Истина;
	ПоказыватьДействующуюЦену	= Истина;
	ПоказыватьИзменениеЦен		= Ложь;
	ПоказыватьЦенуЗакупки		= Истина;
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыЦен.ЗначенияПеречисления Цикл
		АктуальныеТипыЦен.Добавить(ЗначениеПеречисления.Имя, ЗначениеПеречисления.Синоним);		
	КонецЦикла;

	Для каждого ТипЦены Из АктуальныеТипыЦен Цикл
		ДобавитьРеквизитыИЭлементыТабличнойЧастиПоВидуЦен(ТипЦены);
	КонецЦикла; 
	
	КэшДанных = Новый Структура("ЗначенияПодбора", Новый Соответствие());

	// создадим меню заполнения по группам подбора
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Номенклатура.ГруппаПодбора
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	НЕ Номенклатура.ГруппаПодбора ЕСТЬ NULL
	             |	И Номенклатура.ГруппаПодбора <> ЗНАЧЕНИЕ(Справочник.ГруппыПодбораНоменклатуры.ПустаяСсылка)";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Истина Тогда 
			
			Представление = СтрокаБуквами(Выборка.ГруппаПодбора);
			ЭлементПодменю = ЭтаФорма.Элементы.Добавить("Подменю_" + Представление, Тип("ГруппаФормы"), Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыГруппаЗаполнениеПодменю.ПодчиненныеЭлементы.ПодменюЗаполнитьПоТоварнойГруппе);
			ЭлементПодменю.Вид = ВидГруппыФормы.Подменю;   
			ЭлементПодменю.Заголовок = Выборка.ГруппаПодбора;
			запрВлож = Новый Запрос;  
			запрВлож.УстановитьПараметр("Ссылка", Выборка.ГруппаПодбора);
			запрВлож.Текст = "ВЫБРАТЬ
			             |	Номенклатура.Ссылка КАК Ссылка
			             |ИЗ
			             |	Справочник.Номенклатура КАК Номенклатура
			             |ГДЕ
			             |	Номенклатура.ЭтоГруппа
			             |	И НЕ Номенклатура.ПометкаУдаления
			             |	И Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&Ссылка)";   
			ВыборкаВлож = запрВлож.Выполнить().Выбрать();
			Пока ВыборкаВлож.Следующий() Цикл 
				ПредставлениеВлож = СтрокаБуквами(ВыборкаВлож.Ссылка);
				Кмд = ЭтаФорма.Команды.Добавить("Команда_" + ПредставлениеВлож);
				Кмд.Действие = "НажатиеКнопкиПодбораМеню";
				Кмд.Заголовок = ВыборкаВлож.Ссылка;
				Элемент = ЭтаФорма.Элементы.Добавить("Кнопка_" + ПредставлениеВлож, Тип("КнопкаФормы"), ЭлементПодменю);
				Элемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
				Элемент.ИмяКоманды 	= "Команда_" + ПредставлениеВлож;
				КэшДанных.ЗначенияПодбора.Вставить(Элемент.ИмяКоманды, ВыборкаВлож.Ссылка); 
			КонецЦикла;
			
		Иначе
			
			Представление = СтрокаБуквами(Выборка.ГруппаПодбора);
			Кмд = ЭтаФорма.Команды.Добавить("Команда_" + Представление);
			Кмд.Действие = "НажатиеКнопкиГруппыПодбора";
			Кмд.Заголовок = Выборка.ГруппаПодбора;

			Элемент = ЭтаФорма.Элементы.Добавить("Кнопка_"+Представление, Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыГруппаЗаполнение);
			Элемент.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;
			Элемент.ИмяКоманды 	= "Команда_" + Представление;
			Элемент.Картинка 	= БиблиотекаКартинок.ПерейтиНазад; 
			Элемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
			запр = Новый Запрос;  
			запр.УстановитьПараметр("Ссылка", Выборка.ГруппаПодбора);
			запр.Текст = "ВЫБРАТЬ
			             |	Номенклатура.Ссылка КАК Ссылка
			             |ИЗ
			             |	Справочник.Номенклатура КАК Номенклатура
			             |ГДЕ
			             |	Номенклатура.ЭтоГруппа
			             |	И НЕ Номенклатура.ПометкаУдаления
			             |	И Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&Ссылка)";
			МассивГрупп = Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
			КэшДанных.ГруппыПодбора.Вставить(Элемент.ИмяКоманды, Новый Структура("ГруппаПодбора, ГруппыНоменклатуры", Выборка.ГруппаПодбора, МассивГрупп));  
			
		КонецЕсли;
		
	КонецЦикла;

	// создадим меню заполнения по производителям
	Запр2 = Новый Запрос;
	Запр2.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Номенклатура.Производитель КАК Производитель
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Производитель <> ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	             |	И НЕ Номенклатура.ПометкаУдаления";
	Выборка2 = запр2.Выполнить().Выбрать();
	Пока Выборка2.Следующий() Цикл 
		Представление2 = СтрокаБуквами(Выборка2.Производитель);
		Кмд = ЭтаФорма.Команды.Добавить("Команда2_" + Представление2);
		Кмд.Действие = "НажатиеКнопкиПодбораМеню";
		Кмд.Заголовок = Выборка2.Производитель;
		Элемент = ЭтаФорма.Элементы.Добавить("Кнопка2_" + Представление2, Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыГруппаЗаполнениеПодменю.ПодчиненныеЭлементы.ПодменюЗаполнитьПоБренду);
		Элемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элемент.ИмяКоманды 	= "Команда2_" + Представление2;
		КэшДанных.ЗначенияПодбора.Вставить(Элемент.ИмяКоманды, Выборка2.Производитель); 
	КонецЦикла;

	// заполним ТЗ на форме 
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	МИНИМУМ(УстановкаЦенТовары.НомерСтроки) КАК НомерСтроки,
	             |	УстановкаЦенТовары.Номенклатура
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	УстановкаЦенТовары.Номенклатура
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерСтроки
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	УстановкаЦенТовары.Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены,
	             |	УстановкаЦенТовары.Цена,
	             |	УстановкаЦенТовары.Количество,
	             |	УстановкаЦенТовары.РазрешитьПродажу
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	УстановкаЦенТовары.Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены,
	             |	УстановкаЦенТовары.Цена,
	             |	УстановкаЦенТовары.Количество,
	             |	УстановкаЦенТовары.РазрешитьПродажу";
	Результат = Запр.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать(); 
	Ном = 0;
	Пока Выборка.Следующий() Цикл  
		Ном = Ном + 1;
		НовСтрока = Товары.Добавить();  
		НовСтрока.Ном 			= Ном;
		НовСтрока.Номенклатура 	= Выборка.Номенклатура;
	КонецЦикла;  
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура))[0];
		Префикс = ИмяЗначенияПеречисления(Выборка.ВидЦены);
		Если Выборка.Количество = -1 Тогда
			СтрокаТЗ[Префикс + "_ЦенаНовая"] 	= Выборка.Цена;
		Иначе
			СтрокаТЗ[Префикс + "_ЦенаКНовая"] 	= Выборка.Цена;
			СтрокаТЗ[Префикс + "_Количество"] 	= Выборка.Количество;
		КонецЕсли;
		Если Выборка.РазрешитьПродажу <> 0 Тогда
			СтрокаТЗ.Продавать = Выборка.РазрешитьПродажу;
		КонецЕсли;
	КонецЦикла;	
	
	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Результат[0].Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	ОтобразитьСтатусДокумента();
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	// проверка дублей строк
	Ошибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из Товары Цикл
		НайдСтроки = Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
		Если НайдСтроки.ВГраница() > 0 Тогда  
			Стр = "";
			Для Инд = 0 По НайдСтроки.ВГраница() Цикл
				Стр = Стр + НайдСтроки[Инд].Номер + ", ";
			КонецЦикла;
			Ошибки.Вставить(СтрокаТЧ.Номенклатура, Стр);
		КонецЕсли;	
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Найдены дубли в строках: '; en = 'Duplicates found in the lines: '") + Символы.ПС;
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 %2 - строки %3%4'; en = '%1 %2 - lines %3%4'"), ТекстОшибки, Ош.Ключ, Ош.Значение, Символы.ПС);
		КонецЦикла;
		ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-3);	
		//Сообщить(ТекстОшибки);
		клОшибка(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Товары.Очистить();
 	ТЗ = Товары.Выгрузить();
   	Для каждого СтрокаТЗ Из ТЗ Цикл
		Номенклатура = СтрокаТЗ.Номенклатура;
		Для каждого ТипЦены Из АктуальныеТипыЦен Цикл  
			Префикс = ТипЦены.Значение;
			Цена = СтрокаТЗ[Префикс+"_ЦенаНовая"];	
			ЦенаК = СтрокаТЗ[Префикс+"_ЦенаКНовая"];	
			//Если Цена > 0 Тогда
				НовСтрока = ТекущийОбъект.Товары.Добавить();
				НовСтрока.Номенклатура 	= Номенклатура;
			    НовСтрока.ВидЦены		= Перечисления.ВидыЦен[Префикс];
				НовСтрока.Цена			= Цена;
			    НовСтрока.Количество	= -1;
				НовСтрока.РазрешитьПродажу = СтрокаТЗ.Продавать;
			//КонецЕсли;
			//Если СтрокаТЗ[Префикс+"_Количество"] > 0 Тогда
				НовСтрока = ТекущийОбъект.Товары.Добавить();
				НовСтрока.Номенклатура 	= Номенклатура;
			    НовСтрока.ВидЦены		= Перечисления.ВидыЦен[Префикс];
				НовСтрока.Цена			= ЦенаК;
			    НовСтрока.Количество	= СтрокаТЗ[Префикс+"_Количество"];	
				НовСтрока.РазрешитьПродажу = СтрокаТЗ.Продавать;
			//КонецЕсли;  
		КонецЦикла;
	КонецЦикла;
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОтобразитьСтатусДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") Тогда
		    Номенклатура = ОтобраннаяНоменклатура("Менеджер", ВыбранноеЗначение);
			//         
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Производители") Тогда
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		Иначе
		
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;                               
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПересчетЦен" Тогда
		Если Параметр.Было <> 0 И Параметр.Стало <> 0 Тогда
			Для каждого СтрокаТЧ Из Товары Цикл 
				Для каждого ТипЦены Из АктуальныеТипыЦен Цикл
					Префикс = ТипЦены.Значение;
					СтрокаТЧ[Префикс+"Цена"] = СтрокаТЧ[Префикс+"Цена"] / Параметр.Было * Параметр.Стало;	
			     КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура НажатиеКнопкиПодбораМеню(Команда)
	
	ЗаполнитьТаблицуЗначенийТовары(КэшДанных.ЗначенияПодбора.Получить(Команда.Имя));
	Модифицированность = Истина;
	 
 КонецПроцедуры 

//&НаКлиенте
//Процедура НажатиеКнопкиГруппыПодбора(Команда)
//	
//	Список = Новый СписокЗначений;
//	Список.ЗагрузитьЗначения(КэшДанных.ГруппыПодбора[Команда.Имя].ГруппыНоменклатуры);
//	//ВыбГруппа = ВыбратьИзМеню(Список, Элементы[СтрЗаменить(Команда.Имя,"Команда_","Кнопка_")]);
//	ВыбГруппа = ВыбратьИзМеню(Список, Элементы.ДекорацияМеню);
//	Если ВыбГруппа <> Неопределено Тогда
//		ЗаполнитьТаблицуЗначенийТовары(ВыбГруппа.Значение);
//		Модифицированность = Истина;
//	КонецЕсли;
//	 
// КонецПроцедуры 
 
#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСпецификациюПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДействующуюЦенуПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИзменениеПриИзменении(Элемент)

	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЦенуЗакупкиПриИзменении(Элемент)

	УстановитьВидимостьКолонок();

КонецПроцедуры

//&НаСервере
//Функция ДанныеСтроки()

//	Запр = Новый Запрос;
//	Запр.УстановитьПараметр("ДатаОстатков", );
//	Запр.УстановитьПараметр("Номенклатура", );
//	Запр.Текст = "ВЫБРАТЬ
//	             |	спрНоменклатура.Ссылка КАК Номенклатура,
//	             |	ЗначенияСвойствОбъектов.ЗначениеСвойства.Наименование КАК Картинка,
//	             |	ЦеныЗакупки.Цена,
//	             |	ЦеныПродажи.ВидЦены,
//	             |	ЦеныПродажи.Цена КАК Цена1,
//	             |	ЦеныПродажи.Количество
//	             |ИЗ
//	             |	Справочник.Номенклатура КАК спрНоменклатура
//	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЦеныЗакупкиСрезПоследних.Номенклатура КАК Номенклатура,
//	             |			ЦеныЗакупкиСрезПоследних.Цена КАК Цена
//	             |		ИЗ
//	             |			РегистрСведений.ЦеныЗакупки.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныЗакупкиСрезПоследних) КАК ЦеныЗакупки
//	             |		ПО (ЦеныЗакупки.Номенклатура = спрНоменклатура.Ссылка)
//	             |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЗначенияСвойствОбъектов.Объект КАК Объект,
//	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства КАК ЗначениеСвойства
//	             |		ИЗ
//	             |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
//	             |		ГДЕ
//	             |			ЗначенияСвойствОбъектов.Свойство.Наименование = ""Спецификация"") КАК ЗначенияСвойствОбъектов
//	             |		ПО спрНоменклатура.Ссылка = ЗначенияСвойствОбъектов.Объект
//	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЦеныПродажиСрезПоследних.Номенклатура КАК Номенклатура,
//	             |			ЦеныПродажиСрезПоследних.ВидЦены КАК ВидЦены,
//	             |			ЦеныПродажиСрезПоследних.Цена КАК Цена,
//	             |			ЦеныПродажиСрезПоследних.Количество КАК Количество,
//	             |			ЦеныПродажиСрезПоследних.Валюта КАК Валюта
//	             |		ИЗ
//	             |			РегистрСведений.ЦеныПродажи.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныПродажиСрезПоследних) КАК ЦеныПродажи
//	             |		ПО (ЦеныПродажи.Номенклатура = спрНоменклатура.Ссылка)
//	             |ГДЕ
//	             |	спрНоменклатура.Ссылка В(&Номенклатура)";
//	

//КонецФункции 

#КонецОбласти


#Область СозданиеТаблицыЗначенийНаФорме

&НаСервере
Функция РеквизитДобавленРаннее(ИмяТабличнойЧасти, ПутьКРеквизитуИИмяЭлемента)
	
	МассивРеквизитов = ПолучитьРеквизиты(ИмяТабличнойЧасти);
	Для каждого РеквизитФормы Из МассивРеквизитов Цикл
		
		Если РеквизитФормы.Имя = ПутьКРеквизитуИИмяЭлемента Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ДобавитьРеквизитыИЭлементыТабличнойЧастиПоВидуЦен(ВыбранныйВидЦен)
	
	ПутьРеквизита = "Товары";
	ШиринаКолонки = 11;
	
	//ИмяПеречисления = ВыбранныйВидЦен.Метаданные().Имя;
	//ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ВыбранныйВидЦен);
	//ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	////ИмяЗначенияПеречисления = ИмяЗначенияПеречисления(ВыбранныйВидЦен);
	ИмяЗначенияПеречисления = ВыбранныйВидЦен.Значение;
	
	// ::: Создание реквизитов
	ПрефиксРеквизитов	= ИмяЗначенияПеречисления;
	ТипЧислоЦелое 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ТипЧислоПлюс 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ТипЧислоЛюбое 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
	ТипСтрока			= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20));
	ТипБулево			= Новый ОписаниеТипов("Булево");
	
	//МассивТипов			= Новый	 Массив;
	//МассивТипов.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерения"));
	//МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	//
	//ТипЕдИзмерения		= Новый ОписаниеТипов(МассивТипов);
	
	//РеквизитЦенаЗакупки	= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаЗакупки",	ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена закуп.'; en = 'Purch. price'"));
	РеквизитЦенаДо		= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаДо",		ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена до'; en = 'Price before'"));
	РеквизитДельта		= Новый РеквизитФормы(ПрефиксРеквизитов + "_Дельта",		ТипЧислоЛюбое,	ПутьРеквизита, "Δ");
	РеквизитЦенаНовая	= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаНовая",		ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена новая'; en = 'Price new'"));
	РеквизитЦенуИзменили= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенуИзменили",	ТипБулево,		ПутьРеквизита, НСтр("ru = '_Служебный'; uk = '_Службовий'"));
	//РеквизитЕдИзмерения	= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЕдИзм",		ТипЕдИзмерения,	ПутьРеквизита, НСтр("ru = 'Ед. изм.'; uk = 'Од. вим.'"));
	РеквизитКоличество	= Новый РеквизитФормы(ПрефиксРеквизитов + "_Количество",	ТипЧислоЦелое,	ПутьРеквизита, НСтр("ru = 'Количество'; en = 'Quantity'"));
	//РеквизитЦенаКДо		= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаКДо",		ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена с К. до'; en = 'Price Q. before'"));
	РеквизитЦенаКДо		= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаКДо",		ТипСтрока,		ПутьРеквизита, НСтр("ru = 'Цена от К. до'; en = 'Price Q. before'"));
	РеквизитДельтаК		= Новый РеквизитФормы(ПрефиксРеквизитов + "_ДельтаК",		ТипЧислоЛюбое,	ПутьРеквизита, "Δ");
	РеквизитЦенаКНовая	= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаКНовая",	ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена от К. новая'; en = 'Price Q. new'"));
	РеквизитЦенуКИзменили= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенуКИзменили",ТипБулево,		ПутьРеквизита, НСтр("ru = '_СлужебныйК'; uk = '_Службовий'"));
	
	МассивРеквизитов 	= Новый Массив;
	//МассивРеквизитов.Добавить(РеквизитЦенаЗакупки);
	МассивРеквизитов.Добавить(РеквизитЦенаДо);
	МассивРеквизитов.Добавить(РеквизитДельта);
	МассивРеквизитов.Добавить(РеквизитЦенаНовая);
	МассивРеквизитов.Добавить(РеквизитЦенуИзменили);
	//МассивРеквизитов.Добавить(РеквизитЕдИзмерения);
	МассивРеквизитов.Добавить(РеквизитКоличество);
	МассивРеквизитов.Добавить(РеквизитЦенаКДо);
	МассивРеквизитов.Добавить(РеквизитДельтаК);
	МассивРеквизитов.Добавить(РеквизитЦенаКНовая);
	МассивРеквизитов.Добавить(РеквизитЦенуКИзменили);
	
	ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	
	// ::: Создание элементов формы

	ГруппаЦены					= Элементы.Добавить(ПрефиксРеквизитов, Тип("ГруппаФормы"), Элементы[ПутьРеквизита]);
	ГруппаЦены.Заголовок		= ВыбранныйВидЦен.Представление;
	ГруппаЦены.Группировка		= ГруппировкаКолонок.Горизонтальная;
	ГруппаЦены.ОтображатьВШапке	= Истина;
	ГруппаЦены.ОтображатьЗаголовок = Истина;

	//ЭлементЦенаЗакуп				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаЗакупки", Тип("ПолеФормы"), ГруппаЦены);
	//ЭлементЦенаЗакуп.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементЦенаЗакуп.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаЗакупки";
	//ЭлементЦенаЗакуп.Ширина			= ШиринаКолонки;
	//ЭлементЦенаЗакуп.Видимость		= ПоказыватьЦенуЗакупки;
	//ЭлементЦенаЗакуп.ТолькоПросмотр	= Истина;
	//ЭлементЦенаЗакуп.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//ЭлементЦенаЗакуп.РастягиватьПоГоризонтали = Ложь;
	
	//+
	ГруппаЦена						= Элементы.Добавить(ПрефиксРеквизитов + "_ГрЦена", Тип("ГруппаФормы"), ГруппаЦены);
	ГруппаЦена.Заголовок			= "Без количества";
	ГруппаЦена.Группировка			= ГруппировкаКолонок.Горизонтальная;
	ГруппаЦена.ОтображатьВШапке		= Истина;
	ГруппаЦена.ОтображатьЗаголовок 	= Истина;
	
	ГруппаЦенаК						= Элементы.Добавить(ПрефиксРеквизитов + "_ГрЦенаК", Тип("ГруппаФормы"), ГруппаЦены);
	ГруппаЦенаК.Заголовок			= "С количеством";
	ГруппаЦенаК.Группировка			= ГруппировкаКолонок.Горизонтальная;
	ГруппаЦенаК.ОтображатьВШапке	= Истина;
	ГруппаЦенаК.ОтображатьЗаголовок = Истина;
	//-
	
	ЭлементЦенаДо 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаДо", Тип("ПолеФормы"), ГруппаЦена);
	ЭлементЦенаДо.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементЦенаДо.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаДо";
	ЭлементЦенаДо.Ширина		= ШиринаКолонки;
	ЭлементЦенаДо.Видимость		= ПоказыватьДействующуюЦену;
	ЭлементЦенаДо.ТолькоПросмотр= Истина;
	ЭлементЦенаДо.ЦветТекста	= ЦветаСтиля.НедоступныеДанныеЦвет;
	ЭлементЦенаДо.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементДельта 				= Элементы.Добавить(ПрефиксРеквизитов + "_Дельта", Тип("ПолеФормы"), ГруппаЦена);
	ЭлементДельта.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементДельта.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_Дельта";
	ЭлементДельта.Ширина		= ШиринаКолонки;
	ЭлементДельта.Видимость		= ПоказыватьИзменениеЦен;
	ЭлементДельта.ТолькоПросмотр= Истина;
	ЭлементДельта.ЦветТекста	= ЦветаСтиля.НедоступныеДанныеЦвет;
	ЭлементДельта.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементНовая 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаНовая", Тип("ПолеФормы"), ГруппаЦена);
	ЭлементНовая.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементНовая.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаНовая";
	ЭлементНовая.Ширина			= ШиринаКолонки;
	//ЭлементНовая.Видимость		= Объект.ПоказыватьНовуюЦену;
	//ЭлементНовая.УстановитьДействие("ПриИзменении", "Подключаемый_НоваяЦенаПриИзменении");
	ЭлементНовая.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементИзменили 			= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенуИзменили", Тип("ПолеФормы"), ГруппаЦена);
	ЭлементИзменили.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементИзменили.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенуИзменили";
	ЭлементИзменили.Видимость	= Ложь;
	
	//ЭлементЕдИзм 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЕдИзм", Тип("ПолеФормы"), ГруппаЦены);
	//ЭлементЕдИзм.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементЕдИзм.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЕдИзм";
	//ЭлементЕдИзм.Ширина			= 8;
	//ЭлементЕдИзм.УстановитьДействие("ПриИзменении", "Подключаемый_ЕдиницаИзмеренияПриИзменении");
	//ЭлементЕдИзм.РастягиватьПоГоризонтали = Ложь;
	//ЭлементЕдИзм.Видимость		= Объект.ПоказыватьЕдиницыИзмерения;
	
	//+
	
	ЭлементЦенаКДо 					= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаКДо", Тип("ПолеФормы"), ГруппаЦенаК);
	ЭлементЦенаКДо.Вид				= ВидПоляФормы.ПолеВвода;
	ЭлементЦенаКДо.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаКДо";
	ЭлементЦенаКДо.Ширина			= ШиринаКолонки;
	ЭлементЦенаКДо.Видимость		= ПоказыватьДействующуюЦену;
	ЭлементЦенаКДо.ТолькоПросмотр	= Истина;
	ЭлементЦенаКДо.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	ЭлементЦенаКДо.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементДельтаК 					= Элементы.Добавить(ПрефиксРеквизитов + "_ДельтаК", Тип("ПолеФормы"), ГруппаЦенаК);
	ЭлементДельтаК.Вид				= ВидПоляФормы.ПолеВвода;
	ЭлементДельтаК.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ДельтаК";
	ЭлементДельтаК.Ширина			= ШиринаКолонки;
	ЭлементДельтаК.Видимость		= ПоказыватьИзменениеЦен;
	ЭлементДельтаК.ТолькоПросмотр	= Истина;
	ЭлементДельтаК.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	ЭлементДельтаК.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементКоличество				= Элементы.Добавить(ПрефиксРеквизитов + "_Количество", Тип("ПолеФормы"), ГруппаЦенаК);
	ЭлементКоличество.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементКоличество.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_Количество";
	ЭлементКоличество.Ширина		= ШиринаКолонки;
	ЭлементКоличество.РастягиватьПоГоризонтали = Ложь;
    //ЭлементКоличество.ГиперссылкаЯчейки = Истина;
	
	ЭлементНоваяК 					= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаКНовая", Тип("ПолеФормы"), ГруппаЦенаК);
	ЭлементНоваяК.Вид				= ВидПоляФормы.ПолеВвода;
	ЭлементНоваяК.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаКНовая";
	ЭлементНоваяК.Ширина			= ШиринаКолонки;
	//ЭлементНоваяК.Видимость		= Объект.ПоказыватьНовуюЦену;
	//ЭлементНоваяК.УстановитьДействие("ПриИзменении", "Подключаемый_НоваяЦенаПриИзменении");
	ЭлементНоваяК.РастягиватьПоГоризонтали = Ложь;
	
	ЭлементКИзменили 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенуКИзменили", Тип("ПолеФормы"), ГруппаЦенаК);
	ЭлементКИзменили.Вид			= ВидПоляФормы.ПолеВвода;
	ЭлементКИзменили.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенуКИзменили";
	ЭлементКИзменили.Видимость		= Ложь;
	
	//-
	
	
	
	
	//НовыйПараметр = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы." + ИмяТабличнойЧасти + ".ТекущиеДанные.Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать);
	//
	//МассивПараметровВыбора = Новый Массив;
	//МассивПараметровВыбора.Добавить(НовыйПараметр);
	//ЭлементЕдИзм.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	//
	//Если ПодчиненныеВидыЦен.Количество() > 0 Тогда
	//	
	//	Для каждого ЗависимаяЦена Из ПодчиненныеВидыЦен Цикл
	//		
	//		ПутьКРеквизитуИИмяЭлементаДо 		= ЗависимаяЦена.ИдентификаторФормул + "_ЦенаДо";
	//		ПутьКРеквизитуИИмяЭлементаДельта	= ЗависимаяЦена.ИдентификаторФормул + "_Дельта";
	//		ПутьКРеквизитуИИмяЭлементаНовая		= ЗависимаяЦена.ИдентификаторФормул + "_ЦенаНовая";
	//		МассивРеквизитов.Очистить();
	//		Если НЕ РеквизитДобавленРаннее(ИмяТабличнойЧасти, ПутьКРеквизитуИИмяЭлементаДо) Тогда
	//			
	//			РеквизитЦенаЗависимаяДо 	= Новый РеквизитФормы(ПутьКРеквизитуИИмяЭлементаДо, ТипЧислоПлюс, ПутьРеквизита, ЗависимаяЦена.Наименование + " до");
	//			МассивРеквизитов.Добавить(РеквизитЦенаЗависимаяДо);
	//			
	//		КонецЕсли;
	//		
	//		Если НЕ РеквизитДобавленРаннее(ИмяТабличнойЧасти, ПутьКРеквизитуИИмяЭлементаДельта) Тогда
	//			
	//			РеквизитЦенаЗависимаяДельта 	= Новый РеквизитФормы(ПутьКРеквизитуИИмяЭлементаДельта, ТипЧислоЛюбое, ПутьРеквизита, "Δ");
	//			МассивРеквизитов.Добавить(РеквизитЦенаЗависимаяДельта);
	//			
	//		КонецЕсли;
	//		
	//		Если НЕ РеквизитДобавленРаннее(ИмяТабличнойЧасти, ПутьКРеквизитуИИмяЭлементаНовая) Тогда
	//			
	//			РеквизитЦенаЗависимаяНовая 	= Новый РеквизитФормы(ПутьКРеквизитуИИмяЭлементаНовая, ТипЧислоПлюс, ПутьРеквизита, ЗависимаяЦена.Наименование + " новая");
	//			МассивРеквизитов.Добавить(РеквизитЦенаЗависимаяНовая);
	//			
	//		КонецЕсли;
	//		
	//		Если МассивРеквизитов.Количество() > 0 Тогда
	//			
	//			ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	//			
	//		КонецЕсли;
	//		
	//		// зависимая цена до
	//		ЭлементЗависимаяЦена 				= Элементы.Добавить(ПрефиксРеквизитов + ПутьКРеквизитуИИмяЭлементаДо, Тип("ПолеФормы"), ГруппаЦены);
	//		ЭлементЗависимаяЦена.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветРамки;
	//		ЭлементЗависимаяЦена.Вид			= ВидПоляФормы.ПолеВвода;
	//		ЭлементЗависимаяЦена.ПутьКДанным	= ПутьРеквизита + "." + ПутьКРеквизитуИИмяЭлементаДо;
	//		ЭлементЗависимаяЦена.Ширина			= 12;
	//		ЭлементЗависимаяЦена.ТолькоПросмотр	= Истина;
	//		ЭлементЗависимаяЦена.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//		ЭлементЗависимаяЦена.ПропускатьПриВводе = Истина;
	//		ЭлементЗависимаяЦена.Видимость		= Объект.ПоказыватьЗависимыеЦены; 
	//		
	//		// зависимая цена дельта
	//		ЭлементЗависимаяЦена 				= Элементы.Добавить(ПрефиксРеквизитов + ПутьКРеквизитуИИмяЭлементаДельта, Тип("ПолеФормы"), ГруппаЦены);
	//		ЭлементЗависимаяЦена.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветРамки;
	//		ЭлементЗависимаяЦена.Вид			= ВидПоляФормы.ПолеВвода;
	//		ЭлементЗависимаяЦена.ПутьКДанным	= ПутьРеквизита + "." + ПутьКРеквизитуИИмяЭлементаДельта;
	//		ЭлементЗависимаяЦена.Ширина			= 12;
	//		ЭлементЗависимаяЦена.ТолькоПросмотр	= Истина;
	//		ЭлементЗависимаяЦена.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//		ЭлементЗависимаяЦена.ПропускатьПриВводе = Истина;
	//		ЭлементЗависимаяЦена.Видимость		= Объект.ПоказыватьЗависимыеЦены;
	//		
	//		// зависимая цена новая
	//		ЭлементЗависимаяЦена 				= Элементы.Добавить(ПрефиксРеквизитов + ПутьКРеквизитуИИмяЭлементаНовая, Тип("ПолеФормы"), ГруппаЦены);
	//		ЭлементЗависимаяЦена.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветРамки;
	//		ЭлементЗависимаяЦена.Вид			= ВидПоляФормы.ПолеВвода;
	//		ЭлементЗависимаяЦена.ПутьКДанным	= ПутьРеквизита + "." + ПутьКРеквизитуИИмяЭлементаНовая;
	//		ЭлементЗависимаяЦена.Ширина			= 12;
	//		ЭлементЗависимаяЦена.ТолькоПросмотр	= Истина;
	//		ЭлементЗависимаяЦена.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//		ЭлементЗависимаяЦена.ПропускатьПриВводе = Истина;
	//		ЭлементЗависимаяЦена.Видимость		= Объект.ПоказыватьЗависимыеЦены;

	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти


#Область СобытияТЗ

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Элементы.Товары.ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Для каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Номенклатура = ВыбранноеЗначение И СтрокаТЧ <> Элементы.Товары.ТекущиеДанные Тогда
			клОшибка(СтрШаблон("%1 %2!", НСтр("ru = 'Такая номенклатура уже есть в строке'; en = 'This good is already in the document'"), СтрокаТЧ.Ном));
			Элементы.Товары.ТекущиеДанные.Номенклатура = ТекущаяНоменклатура;		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если клНетДа(НСтр("ru = 'Удалить строку?'; en = 'Delete line?'")) Тогда Возврат КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  

	Если Поле.Имя = "ТоварыОстаток" Тогда
	
		Отбор = Новый Структура("Товар", Элемент.ТекущиеДанные.Номенклатура);
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, "ОстаткиОднойНоменклатуры");
		ОткрытьФорму("Отчет.ОстаткиТовара.Форма", ПараметрыФормы, ЭтаФорма, , );
	
	ИначеЕсли Поле.Имя = "ТоварыЗакупка" Тогда

		//Отбор = Новый Структура("Товар", Элемент.ТекущиеДанные.Номенклатура);
		//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, "ОстаткиОднойНоменклатуры");  
		ПараметрыФормы = Новый Структура("Номенклатура, СформироватьПриОткрытии", Элемент.ТекущиеДанные.Номенклатура, Истина);
		ОткрытьФорму("Обработка.ЦеныПоставщиков.Форма", ПараметрыФормы, ЭтаФорма, , );

	Иначе
	
		
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент) 
	
	ПересчитатьНомераСтрокТЗ(Элемент);

КонецПроцедуры

#КонецОбласти     


#Область Служебные

&НаСервереБезКонтекста
Функция СтрокаБуквами(Стр)
	
	Возврат СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("!№;%:?*() -=+/|\.,<>{}[]&#@~", Стр, "");

КонецФункции 

&НаКлиенте
Процедура ОтобразитьСтатусДокумента()

	Если Объект.Передан = Дата(1,1,1) Тогда
		Если Объект.Проведен Тогда
			Статус = НСтр("ru = 'Ожидает передачи в Telegram'; en = ''")
		Иначе 
			Статус = НСтр("ru = 'Редактируется'; en = ''")
		КонецЕсли;	
	Иначе
		Статус = НСтр("ru = 'Передан в Telegram'; en = ''")
	КонецЕсли;
	Статус = СтрШаблон("%1 %2",
						омСервер.Фрмт(НСтр("ru = 'Статус:'; en = 'Status:'"), "НАДПИСЬ_ЦВ1"),
						омСервер.Фрмт(Статус, "НАДПИСЬ_ЦВ2"));
	Элементы.ДекорацияСтатус.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНомераСтрокТЗ(Элемент)

	Для каждого Стр Из Товары Цикл
	    Стр.Ном = Товары.Индекс(Стр)+1;    
	КонецЦикла; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)

	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	Возврат Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;

КонецФункции 

&НаСервереБезКонтекста
Функция ОтобраннаяНоменклатура(ВариантОтбора, ЗначениеОтбора)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Номенклатура.Ссылка
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	НЕ Номенклатура.ПометкаУдаления
	             |	И НЕ Номенклатура.ЭтоГруппа
	             |	И ИСТИНА = ИСТИНА";
	Если ВариантОтбора = "ГруппаНоменклатуры" Тогда
		Условие = "Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)";
	ИначеЕсли ВариантОтбора = "Менеджер" Тогда
		//Условие = "Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)";	
	
	КонецЕсли;
	Запр.Текст = СтрЗаменить(Запр.Текст, "ИСТИНА = ИСТИНА", Условие);
	Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка.ВыгрузитьКолонку(0);

КонецФункции 

#КонецОбласти  


#Область КомандыФормы

&НаКлиенте
Процедура УстановитьВидимостьКолонок()
	
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыКартинка.Видимость = ПоказыватьСпецификацию;
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыЗакупка.Видимость = ПоказыватьЦенуЗакупки;
	Для Инд = 6 По Элементы.Товары.ПодчиненныеЭлементы.Количество() - 1 Цикл 
		Для каждого Элемент Из Элементы.Товары.ПодчиненныеЭлементы[Инд].ПодчиненныеЭлементы Цикл
			Если Прав(Элемент.Имя, 7) = "_ГрЦена" ИЛИ Прав(Элемент.Имя, 8) = "_ГрЦенаК" Тогда
				Для каждого Элт Из Элемент.ПодчиненныеЭлементы Цикл
					Если Прав(Элт.Имя, 7) = "_ЦенаДо" ИЛИ Прав(Элт.Имя, 8) = "_ЦенаКДо" Тогда
						Элт.Видимость = ПоказыватьДействующуюЦену;
					ИначеЕсли Прав(Элт.Имя, 7) = "_Дельта" ИЛИ Прав(Элт.Имя, 8) = "_ДельтаК" Тогда
						Элт.Видимость = ПоказыватьИзменениеЦен;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли	
		КонецЦикла;	
	КонецЦикла;	
	  
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеТоваров(Команда)

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда) 
	
	Номенклатура = Новый СписокЗначений;
	Для каждого СтрокаТЗ Из Товары Цикл
		Номенклатура.Добавить(СтрокаТЗ.Номенклатура);	
	КонецЦикла;

	///Создаем структуру с отбором и добавляем значения
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары"));
	//ПараметрыОтбора.Вставить("Дата", ТекущаяДата());   ///Дополнительный отбор
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы

	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ВыбраннаяНоменклатура", Номенклатура);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНезаполненные(Команда)
	
	Ном = Товары.Количество() - 1;
	Пока Ном >= 0 Цикл     
		ЕстьДанные = Ложь;
		Для каждого ТипЦены Из АктуальныеТипыЦен Цикл
			Префикс = ТипЦены.Значение;
			СтрокаТЗ = Товары[Ном];
			Если СтрокаТЗ[Префикс+"_ЦенаНовая"] > 0 ИЛИ СтрокаТЗ[Префикс+"_ЦенаКНовая"] > 0 ИЛИ СтрокаТЗ[Префикс+"_Количество"] > 0 Тогда
				ЕстьДанные = Истина;
			КонецЕсли;	
		КонецЦикла; 	
		Если НЕ ЕстьДанные Тогда
			Товары.Удалить(Ном); 
			Модифицированность = Истина;
		КонецЕсли;
		Ном = Ном - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)  
	
	Номенклатура = Новый Массив;
	Для каждого СтрокаТЗ Из Товары Цикл
		Номенклатура.Добавить(СтрокаТЗ.Номенклатура);	
	КонецЦикла;
	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Номенклатура); 
	
КонецПроцедуры
	
#КонецОбласти    


&НаСервере
Процедура ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Номенклатура)
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
	Запр.УстановитьПараметр("ДатаОстатков", ?(Объект.Дата=Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата));   
	//Запр.УстановитьПараметр("ДатаОстатков", Объект.Ссылка.МоментВремени());     
	Запр.Текст = "ВЫБРАТЬ
	             |	СпрНоменклатура.Ссылка КАК Номенклатура,
	             |	ЗначенияСвойств.ЗначениеСвойства.Наименование КАК Картинка,
	             |	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток,
	             |	ЦеныПродажи.ВидЦены КАК ВидЦены,
	             |	ЦеныПродажи.Цена КАК Цена,
	             |	ЦеныПродажи.ЦенаОтКоличества КАК ЦенаОтКоличества,
	             |	ЦеныПродажи.Количество КАК Количество,
	             |	ЦеныЗакупки.Цена КАК ЦенаЗакупки,
	             |	ЦеныЗакупки.Валюта КАК ВалютаЗакупки
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Номенклатура.Ссылка КАК Ссылка
	             |	ИЗ
	             |		Справочник.Номенклатура КАК Номенклатура
	             |	ГДЕ
	             |		Номенклатура.Ссылка В(&Номенклатура)) КАК СпрНоменклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства КАК ЗначениеСвойства
	             |		ИЗ
	             |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |		ГДЕ
	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства.Владелец.Наименование = ""Спецификация"") КАК ЗначенияСвойств
	             |		ПО СпрНоменклатура.Ссылка = ЗначенияСвойств.Объект
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ОстаткиТовараОстатки
	             |		ПО СпрНоменклатура.Ссылка = ОстаткиТовараОстатки.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныПродажи
	             |		ПО СпрНоменклатура.Ссылка = ЦеныПродажи.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныЗакупки.СрезПоследних КАК ЦеныЗакупки
	             |		ПО СпрНоменклатура.Ссылка = ЦеныЗакупки.Номенклатура";
	ОбщегоНазначения.ДополнитьТекстЗапросаСпецификациями(Запр.Текст, "ЗначенияСвойств.ЗначениеСвойства.Наименование");
	Выгрузка = Запр.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанных ИЗ Выгрузка Цикл
		СтрокаТЗ = Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДанных.Номенклатура))[0];
		СтрокаТЗ.Картинка 					= СтрокаДанных.Картинка; 
		СтрокаТЗ.Остаток 					= СтрокаДанных.Остаток; 
		СтрокаТЗ.Закупка 					= СтрШаблон("%1 %2", Формат(СтрокаДанных.ЦенаЗакупки, "ЧДЦ=2"), СтрокаДанных.ВалютаЗакупки); 
		Если СтрокаДанных.ВидЦены <> Null Тогда
			Префикс = ИмяЗначенияПеречисления(СтрокаДанных.ВидЦены);  
			СтрокаТЗ[Префикс+"_ЦенаДо"]		= СтрокаДанных.Цена;
			СтрокаТЗ[Префикс+"_ЦенаКДо"]	= СтрШаблон("%1 %2 %3", Формат(СтрокаДанных.ЦенаОтКоличества, "ЧДЦ=2"), НСтр("ru = 'от'; en = 'from'"), СтрокаДанных.Количество);
		КонецЕсли;
	КонецЦикла;  	

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
	//ЗаполнитьТаблицуЗначенийТовары(Значение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийТовары(ЗначениеОтбора)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("МассивНоменклатуры", ЗначениеОтбора); 
	Запр.УстановитьПараметр("Исключения", Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку(0)); 
	Запр.Текст = "ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Номенклатура
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка В(&МассивНоменклатуры)
	             |	И НЕ Номенклатура.Ссылка В (&Исключения)
				 |	И НЕ Номенклатура.ЭтоГруппа
				 |	И НЕ Номенклатура.ПометкаУдаления";  
	Если ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если ЗначениеОтбора.ЭтоГруппа Тогда
			Запр.Текст = СтрЗаменить(Запр.Текст, 
									"В(&МассивНоменклатуры)", 
									"В ИЕРАРХИИ(&МассивНоменклатуры)");	
		КонецЕсли; 
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.ГруппыПодбораНоменклатуры") Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, 
									"Номенклатура.Ссылка В(&МассивНоменклатуры)", 
									"Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&МассивНоменклатуры)");	   
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Производители") Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, 
									"Номенклатура.Ссылка В(&МассивНоменклатуры)", 
									"Номенклатура.Производитель = &МассивНоменклатуры");	   
	КонецЕсли;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = Товары.Добавить();
		НовСтрока.Номенклатура 	= Выборка.Номенклатура; 
		НовСтрока.Ном 			= Товары.Количество();
		ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(НовСтрока.Номенклатура);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяНоменклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоБренду(Команда)

КонецПроцедуры

&НаКлиенте
Процедура ПродаватьВсе(Команда)
	
	ПродаватьВсе = НЕ ПродаватьВсе;
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Документ.УстановкаЦен.Форма.ФормаПересчета", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСНаценкой(Команда)
	
	Наценка = 0;
	Если ВвестиЧисло(Наценка, НСтр("ru = 'Наценка, %'; en = 'Наценка, %'"), 5, 1) Тогда
		Для каждого СтрокаТЧ Из Товары Цикл
			Для каждого ТипЦены Из АктуальныеТипыЦен Цикл
				Префикс = ТипЦены.Значение;
				СтрокаТЧ[Префикс+"ЦенаНовая"] = СтрокаТЧ[Префикс+"ЦенаДо"] * Наценка / 100;
		    КонецЦикла;
		КонецЦикла;
		
	
	КонецЕсли;  
	
КонецПроцедуры

 
&НаКлиенте
Процедура ПоВсемСкладамПриИзменении(Элемент) 
	
	ОбновитьОтображениеЭлементов();   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()

	Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ТоварыГруппаЗаполнение.ПодчиненныеЭлементы.ТоварыПродаватьВсе.Пометка = ПродаватьВсе;	
	Элементы.СкладыСтрокой.Видимость = НЕ ПоВсемСкладам;
	Если Склады.Количество() = 0 Тогда
		СкладыСтрокой = НСтр("ru = '<не выбраны>'; en = '<not selected>'")	
	Иначе 
		Загл = "";
		Для каждого Эл Из Склады Цикл
		 	Загл = Загл + Эл.Значение + ", ";
		КонецЦикла;
		СкладыСтрокой = Загл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	СладыДляВыбора = СладыДляВыбора(Склады);
	СладыДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, НСтр("ru = 'Остатки на складах'; en = 'Warehouse balances'"));

КонецПроцедуры

  
&НаСервереБезКонтекста
Функция СладыДляВыбора(СписокПомеченных)
	
	Спис = Новый СписокЗначений;
	Запр = новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Склады.Ссылка КАК Ссылка,
	             |	ИСТИНА КАК Пометка
	             |ИЗ
	             |	Справочник.Склады КАК Склады
	             |ГДЕ
	             |	НЕ Склады.ПометкаУдаления";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	 	Спис.Добавить(Выборка.Ссылка, , СписокПомеченных.НайтиПОЗначению(Выборка.Ссылка) <> Неопределено);
	КонецЦикла;
	Возврат Спис;
	
КонецФункции // СладыДляВыбора()


&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт
	
	Если Список <> Неопределено Тогда  
		Склады.Очистить();
        Для каждого Элемент из Список Цикл
            Если Элемент.Пометка Тогда
				Склады.Добавить(Элемент.Значение); 
            КонецЕсли;
        КонецЦикла;
	КонецЕсли; 
	ОбновитьОтображениеЭлементов();

КонецПроцедуры
